BusinessProcesses/ПоставкаТовараВАптечныйПункт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<BusinessProcess>
		<Properties>
			<Name>ПоставкаТовараВАптечныйПункт</Name>
			<Task>Task.ЗадачиПоставкиВАптечныеПункты</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АптечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокОтделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеТовараНаСкладе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаличиеТовараНаСкладе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществляетПоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаДокументаПоставки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоставкаВПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/СостояниеПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостояниеПоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦелая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеполнаяПоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БракованнаяПоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаНеОсущствлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварДоставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПриходТовараНаСклад</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НаличиеТовараНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>НаличиеТовараНаСкладе</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Имеентся</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИмеется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОпределено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступленияНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПоступленияНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Склад_АптечныйПункт</xr:Item>
				<xr:Item>AccumulationRegister.РегистрПрибыли</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаБизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПоставкаТовараНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

BusinessProcesses/ПоставкаТовараВАптечныйПункт/Ext/ObjectModule.bsl
Процедура ОдобритьПоставкуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ДокументПоставки=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументПоставки.СостояниеПоставки=Перечисления.СостояниеПоставки.ПоставкаНеОсущствлена;
	ДокументПоставки.СсылкаНаБизнесПроцесс=Ссылка;
	
	ДокументПоставки.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

Процедура ПроверитьНаличиеТовараПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ЗначениеЗаполнено(НаличиеТовараНаСкладе) Тогда
		Сообщить("Не выполнены действия, необходимые для выполнения задачи!", СтатусСообщения.Важное);
   	 	Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры

Процедура ПоставкаТовараНаСкладПриСозданииВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	СостояниеПоставки=Перечисления.СостояниеПоставки.ОжидаетсяПриходТовараНаСклад;
	
	ДокументПоставки=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументПоставки.СостояниеПоставки=СостояниеПоставки;
	ДокументПоставки.Записать(РежимЗаписиДокумента.Запись);

	ДокументПоставкиНаСклад = Документы.ПоступленияНаСклад.СоздатьДокумент();
	ДокументПоставкиНаСклад.Дата=ТекущаяДата();
	
	ТаблицаТоваров = Товары.Выгрузить();
	// Заполняем табл часть БП
	Для Каждого СтрТаблТов Из ТаблицаТоваров Цикл
		//Добавляет строку в конец табличной части документа поставки на склад
		СтрТаблПостНаСклад = ДокументПоставкиНаСклад.Товары.Добавить();
    	СтрТаблПостНаСклад.Наименование = СтрТаблТов.Наименование;
    	СтрТаблПостНаСклад.Количество = СтрТаблТов.Количество;
		//Добавляет строку в конец табличной части БП ПоставкаТовараНаСклад
				СтрБППоставкаНаСклад=ФормируемыеБизнесПроцессы[0].Товары.Добавить();
				СтрБППоставкаНаСклад.Наименование = СтрТаблТов.Наименование;
				СтрБППоставкаНаСклад.Количество = СтрТаблТов.Количество;
	КонецЦикла;
	
	ДокументПоставкиНаСклад.Записать();
	// Заполнить табличную часть докупента поставки на склад с составом продукции 
	
КонецПроцедуры

Процедура ПоставкаТовараНаСкладПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	НаличиеТовараНаСкладе=Перечисления.НаличиеТовараНаСкладе.Имеентся;
КонецПроцедуры

Процедура РаспределитьПоставкуПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не выполнены действия, необходимые для выполнения задачи!", СтатусСообщения.Важное);
   	 	Отказ = Истина;
	Иначе
		// Обнавляем данные документа
		ДокументПоставки=СсылкаДокументаПоставки.ПолучитьОбъект();
		ДокументПоставки.СоСклада=Склад;
		ДокументПоставки.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

// Кто печатает заявку, тот и доставляет.
Процедура РаспечататьЗаявкуНаДоставкуПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ОсуществляетПоставку=ПараметрыСеанса.ТекущийПользователь;
	// Обнавляем данные документа
	ДокументПоставки=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументПоставки.ОсуществляетПоставку=ОсуществляетПоставку;
	ДокументПоставки.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

Процедура ЗагрузитьТоварПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	СостояниеПоставки=Перечисления.СостояниеПоставки.ТоварДоставляется;
	// Обнавляем данные документа
	ДокументБизнесПроцесса=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументБизнесПроцесса.СостояниеПоставки=СостояниеПоставки;
	ДокументБизнесПроцесса.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

Процедура ДоставитьТоварПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Обнавляем данные документа
	ДокументПоставки=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументПоставки.ДатаПоставки=ТекущаяДата();
	ДокументПоставки.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

Процедура УказатьСостояниеПоставкиПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если СостояниеПоставки=Перечисления.СостояниеПоставки.ТоварДоставляется ИЛИ
		СостояниеПоставки=Перечисления.СостояниеПоставки.ПоставкаНеОсущствлена Тогда
		Сообщить("Не выполнены действия, необходимые для выполнения задачи!", СтатусСообщения.Важное);
   	 	Отказ = Истина;
	Иначе
		// Обнавляем данные документа
		ДокументПоставки=СсылкаДокументаПоставки.ПолучитьОбъект();
		ДокументПоставки.СостояниеПоставки=СостояниеПоставки;
		ДокументПоставки.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры

Процедура СостояниеПоставкиОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	Если СостояниеПоставки=Перечисления.СостояниеПоставки.ПоставкаЦелая Тогда
		 Результат=ТочкаВыбораВарианта.Варианты.ПоставкаЦелая
	 ИначеЕсли СостояниеПоставки=Перечисления.СостояниеПоставки.БракованнаяПоставка Тогда
		 
		 Результат=ТочкаВыбораВарианта.Варианты.БракованнаяПоставка;
	 ИначеЕсли СостояниеПоставки=Перечисления.СостояниеПоставки.НеполнаяПоставка Тогда
		 
		 Результат=ТочкаВыбораВарианта.Варианты.НеполнаяПоставка;
	КонецЕсли
	
КонецПроцедуры

Процедура ПроведениеЗаписиДокументаПоставкиОбработка(ТочкаМаршрутаБизнесПроцесса)
	ДокументПоставки=СсылкаДокументаПоставки.ПолучитьОбъект();		
	ДокументПоставки.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
